export const treeDummyData = {
  rootCompany: {
    id: '000001',
    name: '親会社',
    children: [
      {
        id: '000001-1',
        name: '子会社-1',
        children: [
          {
            id: '000001-1-1',
            name: '孫会社-1-1',
          },
          {
            id: '000001-1-1',
            name: '孫会社-1-2',
          },
          {
            id: '000001-1-1',
            name: '孫会社-1-3',
          },
        ],
      },
      {
        id: '000001-2',
        name: '子会社-2',
      },
      {
        id: '000001-3',
        name: '子会社-3',
        children: [
          {
            id: '000001-3-1',
            name: '孫会社-1-3-1',
          },
          {
            id: '000001-3-2',
            name: '孫会社-1-3-2',
            children: [
              {
                id: '000001-3-2-1',
                name: 'ひ孫会社-1-3-2-1',
              },
              {
                id: '000001-3-2-2',
                name: 'ひ孫会社-1-3-2-2',
              },
            ],
          },
          {
            id: '000001-3-3',
            name: '孫会社-1-3-3',
          },
        ]
      },
    ]
  }
}